DataProcessors/КредитныйКалькулятор.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.15">
	<DataProcessor>
		<Properties>
			<Name>КредитныйКалькулятор</Name>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>СуммаКредита</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>16</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СрокКредита</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПроцентнаяСтавка</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>5</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Результат</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Месяц</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СуммаПлатежа</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>16</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ОстатокЗадолженности</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>16</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</DataProcessor>
</MetaDataObject>

DataProcessors/КредитныйКалькулятор/Forms/Форма/Ext/Form/Module.bsl
&НаКлиенте
Процедура Рассчитать(Команда)
	СуммаКред = Объект.СуммаКредита ;
	Ств = Объект.ПроцентнаяСтавка;
	Срок = Объект.СрокКредита;

	Если СуммаКред = 0 Или Ств = 0 Или Срок = 0 Тогда
		Сообщить ("Не правильно введены данные!");
		Возврат
	Иначе
		Колмес = Срок*12;
		Годсумм = (Суммакред/Срок/100*Ств) + (СуммаКред/Срок);
		Переплата = Годсумм*Срок - Суммакред;
		ОбщСумма = СуммаКред + Переплата;
		ЕжемПлат = Общсумма / КолМес;  

		Для Счетчик = 1 По КолМес Цикл
			НоваяСтрока = Объект.Результат.Добавить();
			НоваяСтрока.Месяц = Счетчик;
			НоваяСтрока.СуммаПлатежа = ЕжемПлат;
			ОбщСумма = ОбщСумма - ЕжемПлат; 
			НоваяСтрока.ОстатокЗадолженности = ОбщСумма;
		КонецЦикла;
	КонецЕсли;

КонецПроцедуры
